# Trabalhando com planilhas do excel

In [24]:
import pandas as pd

In [25]:
df1 = pd.read_excel("data bases/Aracaju.xlsx") #existem parametros como pular cabeçalho ou escolher uma aba ps: OLHAR a documentaçao
df2 = pd.read_excel("data bases/Fortaleza.xlsx")
df3 = pd.read_excel("data bases/Natal.xlsx")
df4 = pd.read_excel("data bases/Recife.xlsx")
df5 = pd.read_excel("data bases/Salvador.xlsx")

In [26]:
df = pd.concat([df1, df2, df3, df4, df5])

In [27]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [28]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [29]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [30]:
#alterando o tipo de dado de uma coluna
df["LojaID"] = df["LojaID"].astype("object") #astype muda o tipo do parametro passado
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

Tratando valores faltantes:

In [31]:
df.isnull().sum() #is num verifica se tem valor nulo, e o sum soma todos os valores nulos

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

## Lidando com valores nulos:

- por causa do inplace ta sem valores nulos pq o inplace modifica direto do bando de dados

- fillna implica em substuir os valores nulos de vendas por algo, no caso vai ser pela media

`df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)`

- Substituindo por 0

`df["Vendas"].fillna(0, inplace=True)`

- Apaga todos os valores nulos de todas as colunas

`df.dropna(inplace=True)`

- Para apagar valores de uma coluna especifica:

`df.dropna(subset=["Vendas"], inplace=True)`

- Apagando todas as linhas com valores nulos:

`df.dropna(how="all", inplace=True)`

## Criando novas colunas

In [34]:
# - criando coluna de receitas: receitas vai ser dado pela multiplicação das vendas pelas quantidades

df["Receitas"] = df["Vendas"].mul(df["Qtde"])

# - Criando coluna de quantidade de produtos vendidos

df["Receitas/Vendas"] = df["Receitas"] / df["Vendas"]

df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receitas  Receitas/Vendas
0  Aracaju 2018-01-01  142.00   1520     1    142.00              1.0
1  Aracaju 2018-01-01   14.21   1522     6     85.26              6.0
2  Aracaju 2018-01-01   71.55   1520     1     71.55              1.0
3  Aracaju 2018-01-01    3.01   1521     7     21.07              7.0
4  Aracaju 2018-01-01   24.51   1522     8    196.08              8.0

In [35]:
#Retornando valor maximo

df["Receitas"].max()

3544.0

In [36]:
#Retornando valor minimo

df["Receitas"].min()

3.34

In [37]:
#nlargest retorna o top tier daquele parematro

df.nlargest(5, "Receitas")

   Cidade       Data  Vendas LojaID  Qtde  Receitas  Receitas/Vendas
7   Natal 2019-03-18   886.0    853     4    3544.0              4.0
51  Natal 2018-01-21   859.0    852     4    3436.0              4.0
55  Natal 2019-01-08   859.0    854     4    3436.0              4.0
30  Natal 2018-10-02   856.0    853     4    3424.0              4.0
41  Natal 2018-05-20   835.0    852     4    3340.0              4.0

In [39]:
#smallest retorna o tail tier daquele parematro

df.nsmallest(5, "Receitas")

       Cidade       Data  Vendas LojaID  Qtde  Receitas  Receitas/Vendas
118   Aracaju 2018-01-01    3.34   1522     1      3.34              1.0
65     Recife 2019-01-01    4.01    981     1      4.01              1.0
92      Natal 2019-01-02    4.57   1035     1      4.57              1.0
92   Salvador 2019-01-01    4.57   1035     1      4.57              1.0
95      Natal 2019-01-02    5.13   1035     1      5.13              1.0

In [40]:
#ordenando conjunto de dados:

df.sort_values("Receitas", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receitas  Receitas/Vendas
7   Natal 2019-03-18   886.0    853     4    3544.0              4.0
55  Natal 2019-01-08   859.0    854     4    3436.0              4.0
51  Natal 2018-01-21   859.0    852     4    3436.0              4.0
30  Natal 2018-10-02   856.0    853     4    3424.0              4.0
41  Natal 2018-05-20   835.0    852     4    3340.0              4.0
38  Natal 2018-02-25   828.0    852     4    3312.0              4.0
10  Natal 2018-10-27   828.0    852     4    3312.0              4.0
69  Natal 2019-03-24   817.0    852     4    3268.0              4.0
62  Natal 2018-02-10   793.0    854     4    3172.0              4.0
52  Natal 2018-04-27   778.0    854     4    3112.0              4.0